In [11]:
import pandas as pd
a=pd.Series([1,2,3,4])
b=pd.Series([5,6,7,8])
print(a)

0    1
1    2
2    3
3    4
dtype: int64

In [12]:
type(a)

pandas.core.series.Series

In [13]:
la=list(a)
la

[1, 2, 3, 4]

In [14]:
print('add:',a+b)
print('difference:',b-a)
print('product:',a*b)
print('divide:',b/a)

add: 0     6
1     8
2    10
3    12
dtype: int64
difference: 0    4
1    4
2    4
3    4
dtype: int64
product: 0     5
1    12
2    21
3    32
dtype: int64
divide: 0    5.000000
1    3.000000
2    2.333333
3    2.000000
dtype: float64

In [19]:
st=pd.Series(['saleem','sriram','ali'])
print(st.str.upper())
print(st.str.lower())
print(len(st))

0    SALEEM
1    SRIRAM
2       ALI
dtype: object
0    saleem
1    sriram
2       ali
dtype: object
3

In [25]:
st=pd.Series(['saleem ',' sriram',' ali '])
print('left side white spaces:')
s=st.str
print(s.lstrip())
print('right side white spaces:')
print(s.rstrip())
print(s.strip())

left side white spaces:
0    saleem
1     sriram
2       ali
dtype: object
right side white spaces:
0     saleem
1     sriram
2        ali
dtype: object
0    saleem
1    sriram
2       ali
dtype: object

In [40]:
sinfo=pd.DataFrame(data=[['y20cs190','saleembasha','subhani','9392714584']],columns=['regd number','sname','father name','mobile number'],index=['REGD NUMBER'])

In [41]:
sinfo

            regd number        sname father name mobile number
REGD NUMBER    y20cs190  saleembasha     subhani    9392714584

In [44]:
sinfo.columns

Index(['regd number', 'sname', 'father name', 'mobile number'], dtype='object')

In [45]:
sinfo['sname']='ali'

In [46]:
sinfo

            regd number sname father name mobile number
REGD NUMBER    y20cs190   ali     subhani    9392714584

In [51]:
sinfo['grade']='A'

In [52]:
sinfo

            regd number sname father name mobile number present grade
REGD NUMBER    y20cs190   ali     subhani    9392714584     yes     A

In [57]:
d={'name':'saleem','regd no:':'y20cs190'}
p=pd.DataFrame(d,index=['name'])

In [58]:
p

        name  regd no:
name  saleem  y20cs190